## Pandas
Pandas is a powerful data manipulation library in Python, widely used for data analysis and data cleaning. It provides two primary data structures: Series and DataFrame. A Series is a one-dimensional array-like object, while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [74]:
import pandas as pd

### Series

A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.

In [75]:
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [76]:
# Create a Series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [77]:
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

### Dataframe

A DataFrame is a two-dimensional, tabular data structure in Pandas, similar to an Excel spreadsheet or SQL table. It consists of rows and columns, where:

- Rows have an index (labels for each row).
- Columns have names and contain data of different types (int, float, string, etc.).

In [78]:
# create a Dataframe from a dictionary oof list
data={
    'Name':['Tajamul','Hassan','Khan'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida'],
    'Salary': [1000, 3000, 9000]
}
df1=pd.DataFrame(data)
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [79]:
# Create a Data frame From a List of Dictionaries

data=[
    {'Name':'Krish','Age':32,'City':'Bangalore'},
    {'Name':'John','Age':34,'City':'Bangalore'},
    {'Name':'Bappy','Age':32,'City':'Bangalore'},
    {'Name':'JAck','Age':32,'City':'Bangalore'}
    
]
df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   32  Bangalore
1   John   34  Bangalore
2  Bappy   32  Bangalore
3   JAck   32  Bangalore
<class 'pandas.core.frame.DataFrame'>

In [80]:
import pandas as pd  

url = "https://raw.githubusercontent.com/tajamulkhann/Python-DSA/main/m.%20Python%20for%20Data%20Analysis/data2.csv"  
df = pd.read_csv(url)  

print(df.head())  # Display first few rows

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [81]:
url = "https://raw.githubusercontent.com/tajamulkhann/Python-DSA/refs/heads/main/m.%20Python%20for%20Data%20Analysis/data2.csv"
df = pd.read_csv(url)
df.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [82]:
df.tail(5)

          Date Category  Value   Product  Sales Region
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North

In [83]:
### Accessing Data From Dataframe
df.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [84]:
df['Product'].head()

0    Product1
1    Product3
2    Product2
3    Product1
4    Product3
Name: Product, dtype: object

In [85]:
# first row
df.iloc[0]

Date        2023-01-01
Category             A
Value             28.0
Product       Product1
Sales            754.0
Region            East
Name: 0, dtype: object

In [86]:
## Accessing a specified element
df.at[2,'Product']

'Product2'

In [87]:
df.at[4,'Region']

'North'

In [88]:
## Accessing a specified element using iat
print(df.iat[2,2])

32.0

In [89]:
### Data MAnipulation with Dataframe
df1

      Name  Age       City  Salary
0  Tajamul   25  Bangalore    1000
1   Hassan   30   New York    3000
2     Khan   45    Florida    9000

In [90]:
## Adding a column
df1['Salary']=[50000,60000,70000]
df1

      Name  Age       City  Salary
0  Tajamul   25  Bangalore   50000
1   Hassan   30   New York   60000
2     Khan   45    Florida   70000

In [91]:
## Remove a column
df1.drop('Salary',axis=1,inplace=True)

In [92]:
df1

      Name  Age       City
0  Tajamul   25  Bangalore
1   Hassan   30   New York
2     Khan   45    Florida

In [93]:
## Add age to the column
df1['Age']=df1['Age']+1
df1

      Name  Age       City
0  Tajamul   26  Bangalore
1   Hassan   31   New York
2     Khan   46    Florida

In [95]:
df1.drop(0, axis = 0, inplace=True)

In [96]:
df1

     Name  Age      City
1  Hassan   31  New York
2    Khan   46   Florida